// 舱位等级数据
const classCode = {
  'F': '头等舱',
  'A': '头等舱',
  'C': '公务舱',
  'D': '公务舱',
  'Y': '经济舱',
  'S': '经济舱', 
  'B': '经济舱',
  'H': '经济舱',
  'K': '经济舱',
  'L': '经济舱',
  'M': '经济舱',
  'N': '经济舱',
  'Q': '经济舱',
  'T': '经济舱',
  'X': '经济舱',
  'U': '经济舱',
  'E': '经济舱',
  'W': '高级经济舱',
  'R': '经济舱',
  'O': '经济舱',
  'Z': '经济舱',
  'V': '经济舱',
  'J': '公务舱',
  'G': '经济舱' 
};
// 订单状态数据
const orderStatus = {
  1:'订单创建',
  2:'订单出票',
  3:'订单完成',
  4:'订单取消',
  5:'订单退订',
  6:'订单作废',
  106:'订单改签',
  107:'正在出票'
}

// 数据
const approvalStatus = {
  0:'审核中',
  1:'已通过',
  2:'未通过',
  3:'未提交',
  4:'已过期',
  5:'未审批'
}

export {
  classCode,
  orderStatus,
  approvalStatus
}